const Data04 = [
    {
        title: "1. What do you think makes front-end development attractive?",
        desc: "프론트엔드의 영역은 코드와 디자인이 만나는 독특한 공간이기에, 웹 개발에 있어 프론트엔드가 할 수 있는 일이 정말 많다고 생각합니다. 그만큼 부딪혀야 할 일이 많아 험난할 것이라 예상되지만 개발의 전반적인 부분을 담당할 수 있다는 점 때문에, 한 켠으로는 설레는 일이라 생각됩니다.",
    },
    {
        title: "2. What was your proudest moment in front-end work?",
        desc: "문제에 직면하고 그 문제들을 하나씩 해결해나갈 때, 그리고 그러한 과정들이 모여 프로젝트를 성공적으로 마무리 할 때 뿌듯함을 느낍니다.    ",
        // 프로그래밍할때  가장 자랑스러웠던 순간
    },
    {
        title: "3. Which front-end framework do you prefer and why?",
        desc: "React를 가장 선호합니다. 선언적이고 효율적인 UI구축을 가능하게 하는 JSX문법 덕에 가독성이 높고, 컴포넌트 기반의 개발을 용이하게 하기 때문입니다. 이 밖에도 매우 큰 개발자 커뮤니티가 있기 떄문에 다양한 라이브러리와 도구를 활용할 수 있다는 장점이 많은 유연성과 효율성을 제공합니다.",
        // 어떤 프레임워크를 가장 편안하게 느끼나
    },
    {
        title: "4. What methods do you use to enhance user experience?",
        desc: "저는 사용자의 실수나 불편함을 최소화하는 데 중점을 둡니다. 사용자가 편안하게 사이트를 이용할 수 있도록, 직관적인 인터페이스 디자인, 빠른 로딩 시간, 접근성을 고려한 콘텐츠 배치 등을 통해 전반적인 사용자 만족도를 높이는 데 주력합니다.", // 유저 경험을 향상시키기 위해 특별히 신경쓰는 부분
    },
    {
        title: "5. How do you maintain code quality in teamwork?",
        desc: "팀워크에서 코드 품질을 유지하기 위해 몇 가지 핵심 원칙을 따릅니다. 첫째, 명확한 코딩 컨벤션과 스타일 가이드를 설정하여 모든 팀원이 일관된 코드 스타일을 유지하도록 합니다. 둘째, 코드 리뷰를 정기적으로 실시하여 서로의 코드를 검토하고 개선점을 제시함으로써 코드의 질을 지속적으로 향상시킵니다. 이러한 절차들이 효율적인 협업을 하는데 도움이 되었던 것 같습니다.",
        // 협업 시 코드의 일관성과 품질을 유지하기 위해 어떤 방법을 사용하나
    },
    {
        title: "6. What's your approach to learning new front-end tech?",
        desc: "필요한 기술을 배우는데 있어서는, 우선 관련된 강의를 듣고 문제를 해결해가며 모르는 부분은 공식 문서나, 블로그를 참조해보는 편입니다.",
        // 프론트엔드 기술을 배우는데 있어 어떤 접근 방식
    },
    {
        title: "7. What's the toughest bug you've solved, and how?",
        desc: "가장 어려웠던 버그는 복잡한 상태 관리 문제였습니다. React 애플리케이션에서 여러 컴포넌트 간 상태가 예기치 않게 변경되어 예측 불가능한 렌더링이 하거나, 불필요한 랜더링이 너무 많이 반복되는 경우가 많았습니다. 이러한 문제는 useCallback() 훅을 통해 해결하고, 글로벌 상태관리의 경우 Redux DevTools를 통해 관리했습니다.", // 마주친 버그를 어떻게 해결했냐
    },
    {
        title: "8. What is key to successful teamwork in development?",
        desc: "개발에서 성공적인 팀워크를 위한 핵심은 명확한 커뮤니케이션과 존중이 가장 중요하다고 생각합니다. 명확한 커뮤니케이션은 프로젝트의 목표를 분명히 하고 팀 내에서 효과적인 의사결정을 가능하게 합니다.", // 팀 프로젝트에서 성공적인 협업을 위해 가장 중요하게 생각하는 것은 무엇인가요?
    },
    {
        title: "9. Can you describe your personal development philosophy?",
        desc: "저는 사용자와 비즈니스 모두에게 가치를 제공하는 소프트웨어를 만들어내는 것을 목표로 삼고 있습니다. 그러기 위해선 새로운 것의 학습을 두려워하지 않아야하고, 기존의 지식을 업데이트하는 노력 또한 게을리하지 않아야함을 잘 알고 있습니다. 실천하기 위해 항상 노력하고 있습니다.",
        // 당신의 개발 철학은 무엇이며, 그것이 어떻게 당신의 작업에 영향을 미치나요?
    },
    {
        title: "10. What are your long-term goals as a front-end developer?",
        desc: "제 장기적인 목표는 프론트엔드 기술에 대해 깊이 이해하고, 웹 개발 분야의 전문가가 되는 것입니다. 웹 서비스의 힘을 깊게 인식하고 있으며, 이를 통해 직접 제품을 만들고 제공하는 경험을 추구하고 있습니다. 이 목표를 달성하기 위해, 계속하여 기술을 학습하고 실질적인 프로젝트에 참여하여, 꿈을 이루기 위해 나아가고 싶습니다.",
        // 프론트엔드 개발자로서 달성하고 싶은 장기적인 목표는 무엇인가요?
    },
];
export default Data04;
